/*=============================================================================+
|  Function :                                                                  |
|  Task     :                                                                  |
|------------------------------------------------------------------------------|
|  Compile  :                                                                  |
|  Link     :                                                                  |
|  Call     :                                                                  |
|------------------------------------------------------------------------------|
|  Author   : Hankin                                                           |
|  Version  : V1.00                                                            |
|  Creation : 2015/01/14                                                       |
|  Revision :                                                                  |
+=============================================================================*/
#include "CommComp_turntable.h"
#include "CommComp_CANOpenMaster.h"
#include "Error_App.h"
//##############################################################################
// definition
//##############################################################################
#define HYDRAULIC_HEARTBEAT_CYCLE 500
#define HYDRAULIC_LOST_MAX 5

#define ELECTRIC_HEARTBEAT_CYCLE 500
#define ELECTRIC_LOST_MAX 5
#define ELECTRIC_ERROR_REQ_CYCLE 100
//##############################################################################
// enumeration
//##############################################################################
enum CommComp_turntable__e_card_type
{
	CommComp_turntable__CARD_TYPE_HYDRAULIC,
	CommComp_turntable__CARD_TYPE_ELECTRIC,
	CommComp_turntable__CARD_TYPE_HT,

	CommComp_turntable__CARD_TYPE_SUM
};

enum CommComp_turntable_e_hydraulic_index
{
	CommComp_turntable_HYDRAULIC_INDEX_0,
	CommComp_turntable_HYDRAULIC_INDEX_1,

	CommComp_turntable_HYDRAULIC_INDEX_SUM
};

enum CommComp_turntable_e_electric_index
{
	CommComp_turntable_ELECTRIC_INDEX_0,
	CommComp_turntable_ELECTRIC_INDEX_1,

	CommComp_turntable_ELECTRIC_INDEX_SUM
};
//##############################################################################
// data type
//##############################################################################
struct CommComp_turntable__s_config_info
{
	enum CommComp_turntable__e_card_type eCard_type;
	unsigned                             iCard_index;
};

struct CommComp_turntable__s_card_hydraulic
{
	CommComp_S          _sComp;
	CANOpenCompUnique_S _sUnique_CANopen_comp;
	S_CANOpenCHBManager _sCHBManager;

	S_CANOpenCHBManager _sPDOManager;
	Ttimer              _sPDOSendTime;

	CommSubComp_S          _sSubcomp;
	CANOpenSubCompUnique_S _sUnique_CANopen_subcomp;

	unsigned _iRemote_index;
	unsigned _iTurntable_index;
	unsigned _iPF_channel;
	unsigned _iComm_cycle;

	// // (slave) recv PDO 1 (auto)
	// WORD i200000; // 0x160001
	// WORD f200100; // 0x160002
	// WORD i200200; // 0x160003

	// (slave) send PDO 1
	WORD i201000; // 0x1A0001
	WORD i3EC800; // 0x1A0002
	WORD i201100; // 0x1A0003
	WORD i201200; // 0x1A0004
};

struct CommComp_turntable__s_card_HT
{
	CommComp_S          _sComp;
	CANOpenCompUnique_S _sUnique_CANopen_comp;
	S_CANOpenCHBManager _sCHBManager;

	S_CANOpenCHBManager _sPDOManager;
	Ttimer              _sPDOSendTime;
	Ttimer              _sErrorReqTime;

	CommSubComp_S          _sSubcomp;
	CANOpenSubCompUnique_S _sUnique_CANopen_subcomp;

	unsigned _iRemote_index;
	unsigned _iTurntable_index;
	unsigned _iComm_cycle;

	// (slave) send PDO 1
	WORD wError;
	WORD wStatusWord;
	INT  nActAngle;
	INT  nActSpd;
	INT  nActValveVolt;
};

struct CommComp_turntable__s_card_electric
{
	CommComp_S          _sComp;
	CANOpenCompUnique_S _sUnique_CANopen_comp;
	S_CANOpenCHBManager _sCHBManager;

	S_CANOpenCHBManager _aPDOManager[2];
	Ttimer              _sPDOSendTime;
	Ttimer              _sErrorReqTime;

	CommSubComp_S          _sSubcomp;
	CANOpenSubCompUnique_S _sUnique_CANopen_subcomp;

	unsigned _iRemote_index;
	unsigned _iTurntable_index;
	unsigned _iPF_channel;
	unsigned _iComm_cycle;

	// SDO
	DWORD i40DA00; // for calculation speed.
	DWORD i40DB00; // for calculation speed.
	DWORD i40DC00; // for calculation angle.
	DWORD i202500; // error.

	// // (slave) recv PDO 1(auto)
	// DWORD i60FF00; // 0x160002
	// WORD  i604000; // 0x160001
	// WORD  i420800; // 0x160003

	// (slave) send PDO 1
	WORD i604100; // 0x1A0001
	WORD i420900; // 0x1A0002

	// (slave) send PDO 2
	LONG  i414200; // 0x1A0101
	FLOAT f200100; // 0x1A0102
};
//##############################################################################
// function declaration
//##############################################################################
void        CommComp_turntable__s_card_hydraulic_init(struct CommComp_turntable__s_card_hydraulic* pCard);
void        CommComp_turntable__s_card_HT_init(struct CommComp_turntable__s_card_HT* pCard);
bool        CommComp_turntable__s_card_hydraulic_add(struct CommComp_turntable__s_card_hydraulic* pCard, unsigned iRemote_index, unsigned iTurntable_index, E_CommType eComm_type, WORD iNode_ID, WORD iComm_cycle);
bool        CommComp_turntable__s_card_HT_add(struct CommComp_turntable__s_card_HT* pCard, unsigned iRemote_index, unsigned iTurntable_index, E_CommType eComm_type, WORD iNode_ID, WORD iComm_cycle);
inline void CommComp_turntable__s_card_hydraulic_del(struct CommComp_turntable__s_card_hydraulic* pCard);
